
&НаСервере
Процедура ПриОткрытииНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЗначенияСвойствНоменклатуры.Свойство КАК Свойство,
		|	ЗначенияСвойствНоменклатуры.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствНоменклатуры КАК ЗначенияСвойствНоменклатуры
		|ГДЕ
		|	ЗначенияСвойствНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДопСвойства.Добавить();
		НоваяСтрока.Свойство = ВыборкаДетальныеЗаписи.Свойство;
		НоваяСтрока.Значение = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДопСвойства.Очистить();
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	// Вставить содержимое обработчика.
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	
	
	 Для Каждого Строка Из ДопСвойства Цикл

        Запись = НаборЗаписей.Добавить();
        Запись.Номенклатура = Объект.Ссылка;
        Запись.Свойство = Строка.Свойство;
        Запись.Значение = Строка.Значение;

    КонецЦикла;

   
    НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры
