
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемВРемонт") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		УстройствоКлиента = ДанныеЗаполнения.УстройствоКлиента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Запчасти.Итог("Сумма") + Услуги.Итог("Цена");
	
	Если ЭтоНовый() Или Ссылка.Статус <> Статус Тогда
		
		МенеджерЗаписи = РегистрыСведений.ИсторияСтатусовРемонтов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период     = ТекущаяДатаСеанса();
		МенеджерЗаписи.ЗаказНаряд = Ссылка; // Или ЭтотОбъект.Ссылка в ПриЗаписи
		МенеджерЗаписи.Статус     = Статус;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	
	
	Если Статус = Перечисления.СтатусыЗаказНаряда.Выдан Тогда
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Запчасти;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");
	Блокировка.Заблокировать();
	
	
    Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;
    Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
    Движения.ВыработкаСотрудников.Записывать = Истина;
    
    Движения.ОстаткиТоваров.Очистить();
    Движения.Продажи.Очистить(); 
    Движения.ВзаиморасчетыСКлиентами.Очистить();
    Движения.ВыработкаСотрудников.Очистить();
    
    Движения.Продажи.Записать();
    Движения.ОстаткиТоваров.Записать();
    Движения.ВзаиморасчетыСКлиентами.Записать();
    Движения.ВыработкаСотрудников.Записать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядЗапчасти.Номенклатура КАК Номенклатура,
		|	ЗаказНарядЗапчасти.Серия КАК Серия,
		|	СУММА(ЗаказНарядЗапчасти.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаказНарядЗапчасти.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
		|ИЗ
		|	Документ.ЗаказНаряд.Запчасти КАК ЗаказНарядЗапчасти
		|ГДЕ
		|	ЗаказНарядЗапчасти.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядЗапчасти.Номенклатура,
		|	ЗаказНарядЗапчасти.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаДокумента.Серия КАК Серия,
		|	ВТ_ТаблицаДокумента.Количество КАК Количество,
		|	ВТ_ТаблицаДокумента.Цена КАК Цена
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Склад = &Склад
		|					И (Номенклатура, Серия) В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура,
		|							ВТ.Серия
		|						ИЗ
		|							ВТ_ТаблицаДокумента КАК ВТ)) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_ТаблицаДокумента.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|			И ВТ_ТаблицаДокумента.Серия = ОстаткиТоваровОстатки.Серия";
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Отказ = Истина;
			Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
			
			ТекстОшибки = СтрШаблон(
				"Не хватает запчасти «%1» (серия: %2) в количестве %3 шт.", 
				Выборка.Номенклатура, 
				?(ЗначениеЗаполнено(Выборка.Серия), Выборка.Серия, "без серии"), 
				Нехватка
			);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.КлючДанных = Ссылка;
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		СписываемаяСумма = 0;
		
		Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
			СписываемаяСумма = Выборка.СуммаОстаток; 
		Иначе
			СписываемаяСумма = Выборка.Количество * (Выборка.СуммаОстаток / Выборка.КоличествоОстаток);
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период      = Дата;
		Движение.Склад       = Склад; 
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Серия       = Выборка.Серия;
		Движение.Количество  = Выборка.Количество;
		Движение.Сумма       = СписываемаяСумма;
		
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество  = Выборка.Количество;
		Движение.Выручка = Выборка.Цена * Выборка.Количество;
		Движение.Себестоимость = СписываемаяСумма;
	КонецЦикла;
	
	Для Каждого Услуга Из Услуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Услуга.Номенклатура;
		Движение.Количество  = 1;
		Движение.Выручка = Услуга.Цена;
		Движение.Себестоимость = Услуга.Цена;
		
		Движение = Движения.ВыработкаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Услуга.Исполнитель;
		Движение.СуммаВыработки = Услуга.Цена;
	КонецЦикла; 
	
	Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.СуммаДолга = СуммаДокумента;
	КонецЕсли;
КонецПроцедуры
