
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
	
	Для Каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Серия) И ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Строка.Серия = СоздатьСерию(Строка.Номенклатура);
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Функция СоздатьСерию(Номенклатура)
	Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Серия.Номенклатура = Номенклатура;
	 Серия.Наименование = 
        Номенклатура.Наименование 
        + " " 
        + Формат(ТекущаяДата(), "ДФ=yyyyMMddHHmmss");
	   
	    Серия.Записать();
    Возврат Серия.Ссылка;
КонецФункции 
