&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОграничениеТипаПолучателя();
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьОграничениеТипаПолучателя();
КонецПроцедуры


Процедура УстановитьОграничениеТипаПолучателя()
	Элементы.Получатель.Доступность = Истина;
	МассивТипов = Новый Массив;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.ОплатаПоставщику") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.ВыплатаЗарплаты") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));	
	КонецЕсли;
	
	Если МассивТипов.Количество() > 0 Тогда
        Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
    Иначе
        Элементы.Получатель.Доступность = Ложь;
    КонецЕсли;
	
	
КонецПроцедуры


 