
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.ВидыДвиженийДенежныхСредств.ОплатаПоставщику  Тогда
		
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСПоставщиками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Поставщик = Получатель;
	Движение.СуммаДолга = Сумма;
	
	ИначеЕсли ВидОперации = Перечисления.ВидыДвиженийДенежныхСредств.ВыплатаЗарплаты Тогда
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Сотрудник = Получатель;
	Движение.СуммаДолга = Сумма;
	КонецЕсли; 
КонецПроцедуры;
