
&НаКлиенте
Процедура РассчитатьПоНаценке(Команда)
	Записать();
	РассчитатьПоНаценкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоНаценкеНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
|	УстановкаЦенНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры
|ПОМЕСТИТЬ ТоварыДокумента
|ИЗ
|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
|ГДЕ
|	УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТоварыДокумента.Номенклатура КАК Номенклатура,
|	ВЫБОР
|		КОГДА ТоварыДокумента.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
|			ТОГДА ЕСТЬNULL(ЦеныПоставщиковСрезПоследних.Цена, 0)
|		ИНАЧЕ ЕСТЬNULL(ЦеныПоставщиковСрезПоследних.Цена, 0) + ЕСТЬNULL(ЦеныПоставщиковСрезПоследних.Цена, 0) * ЕСТЬNULL(МатрицаНаценок.ПроцентНаценки, 0) / 100
|	КОНЕЦ КАК Цена
|ИЗ
|	ТоварыДокумента КАК ТоварыДокумента
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоставщиков.СрезПоследних(, Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыДокумента)) КАК ЦеныПоставщиковСрезПоследних
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаНаценок КАК МатрицаНаценок
|			ПО (ЕСТЬNULL(ЦеныПоставщиковСрезПоследних.Цена, 0) МЕЖДУ МатрицаНаценок.НижнийПорогСуммы И МатрицаНаценок.ВерхнийПорогСуммы)
|		ПО ТоварыДокумента.Номенклатура = ЦеныПоставщиковСрезПоследних.Номенклатура";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



КонецПроцедуры
