&НаКлиенте
Процедура ЗапчастиНоменклатураПриИзменении(Элемент)
	 Элементы.Запчасти.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Запчасти.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКоличествоПриИзменении(Элемент)
	Элементы.Запчасти.ТекущиеДанные.Сумма = РассчитатьСумму(Элементы.Запчасти.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиЦенаПриИзменении(Элемент)
	Элементы.Запчасти.ТекущиеДанные.Сумма = РассчитатьСумму(Элементы.Запчасти.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	 Элементы.Услуги.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Услуги.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	Элементы.Услуги.ТекущиеДанные.Сумма = РассчитатьСумму(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену(Номенклатура)
	Отбор = Новый Структура("Номенклатура", Номенклатура);
	ДанныеЦены = РегистрыСведений.ЦеныПродажи.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ДанныеЦены.ЦенаПродажи;
КонецФункции

&НаКлиенте
Функция РассчитатьСумму(Строка)
	Возврат Строка.Цена * Строка.Количество;
КонецФункции;